// let red = "Нет";
// let yellow = "Да"

// if (red === "Да") /* если горит красный сигнал */
// {
//     alert ('При красном сигнале стоим - дорогу переходить нельзя!');
// }
// else if  (yellow === "Да") /* Если горит жёлтый сигнал */
// {
//     alert ("При жёлтом сигнале нужно приготовиться, но дорогу переходить нельзя!");
// }
// else //* Иначе */
// {
//     alert ("Зелёный сигнал - переходим!");
// }

let signal;
if (signal === 'red') /* Если горит красный сигнал */ {
    alert("Идти нельзя!")
}
else if (signal === "yellow") /* Если горит жёлтый сигнал */ {
    alert ("Приготовиться...")
}
else /* Иначе... */ {
    alert("Переходим дорогу!")
}
